ErrorChen/SensorArray/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_I2C_FREQ_HZ=337500
CONFIG_BOARD_I2C_PORT=0
CONFIG_BOARD_I2C_SDA_GPIO=9
CONFIG_BOARD_I2C_SCL_GPIO=10
CONFIG_BOARD_I2C0_FREQ_HZ=337500
CONFIG_BOARD_I2C1_ENABLE=y
CONFIG_BOARD_I2C1_PORT=1
CONFIG_BOARD_I2C1_SDA_GPIO=11
CONFIG_BOARD_I2C1_SCL_GPIO=12
CONFIG_BOARD_I2C1_FREQ_HZ=337500
CONFIG_SENSORARRAY_FDC_MATRIX_TARGET_FPS=20
CONFIG_SENSORARRAY_FDC_MATRIX_PERIOD_MS=50
CONFIG_SENSORARRAY_FDC_MATRIX_SETTLE_US=1000
CONFIG_SENSORARRAY_FDC_MATRIX_DISCARD_SAMPLES=1
CONFIG_SENSORARRAY_FDC_DISCARD_FRAMES_AFTER_ROW_SWITCH=0
CONFIG_SENSORARRAY_FDC_ROW_EPOCH_RESTART_ENABLE=y
CONFIG_SENSORARRAY_FDC_ROW_EPOCH_RESTART_METHOD_SLEEP=y
CONFIG_SENSORARRAY_FDC_ROW_SWITCH_SETTLE_US=50
CONFIG_SENSORARRAY_FDC_PARALLEL_DUAL_BUS_READ=y
CONFIG_SENSORARRAY_FDC_INTB_ENABLE=y
CONFIG_SENSORARRAY_FDC_INTB1_GPIO=17
CONFIG_SENSORARRAY_FDC_INTB2_GPIO=18
CONFIG_SENSORARRAY_FDC_INTB_TRIGGER_ANYEDGE=y
CONFIG_SENSORARRAY_FDC_INTB_WAIT_TIMEOUT_US=10000
CONFIG_SENSORARRAY_FDC_INTB_FALLBACK_POLLING=y
CONFIG_SENSORARRAY_FDC_DIFF_CACHE_APPLY=y
# CONFIG_SENSORARRAY_FDC_CACHE_APPLY_VERBOSE_LOG is not set
CONFIG_SENSORARRAY_FDC_TEXT_OUTPUT_CAP_TOTAL_PF=y
# CONFIG_SENSORARRAY_FDC_TEXT_OUTPUT_BOTH_INLINE_DEBUG is not set
CONFIG_SENSORARRAY_FDC_RUNTIME_FAST_SWEEP_ENABLE=y
# CONFIG_SENSORARRAY_FDC_REAPPLY_CACHE_ON_WARNING is not set
CONFIG_SENSORARRAY_FDC_WARNING_REAPPLY_ONCE_PER_FINGERPRINT=y
CONFIG_SENSORARRAY_FDC_AMPLITUDE_FAST_SWEEP_THRESHOLD=4
CONFIG_SENSORARRAY_FDC_WARNING_REAPPLY_COOLDOWN_FRAMES=50
CONFIG_SENSORARRAY_FDC_WARNING_FAST_SWEEP_COOLDOWN_MS=1000
CONFIG_SENSORARRAY_FDC_FULL_RESCUE_COOLDOWN_MS=3000
CONFIG_SENSORARRAY_FDC_ALL_INVALID_RESCUE_THRESHOLD=3
CONFIG_SENSORARRAY_FDC_CELL_FAST_SWEEP_FAIL_THRESHOLD=2
CONFIG_SENSORARRAY_FDC_ROW_RESCUE_FAIL_COUNT=4
CONFIG_SENSORARRAY_FDC_RESCUE_TASK_STACK=12288
CONFIG_SENSORARRAY_FDC_TIMING_SUMMARY_PERIOD_FRAMES=10
CONFIG_SENSORARRAY_FDC_TIMING_SUMMARY_AGGREGATE=y
CONFIG_SENSORARRAY_FDC_TIMING_OVERRUN_IMMEDIATE_LOG=y
# CONFIG_SENSORARRAY_FDC_TIMING_VERBOSE_PER_FRAME is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
# CONFIG_TMUX1108_SW_REF_LEVEL is not set
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
